---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctType
source: html/44cca8d0-ff01-1569-c994-9850dec0bb59.htm
---
# DuctType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.